# <font face = 'Impact' color = '#FFAEBC' > Exercise on Loading, Organizing, and Storing Data<font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Licence: GPL v3.0 <font/>
#### <font face = 'Times New Roman' color = '#B5E5CF'> Author and Trainer: Paolo Hilado MSc. (Data Science) <font/>
Showcase your learning and skills by accomplishing this jupyter notebook. Follow through each of the tasks and code with python to address them.

In [1]:
# Import the necesary libraries such as pandas, researchpy, os, and numpy.
import pandas as pd
import researchpy as rp
import os 
import numpy as np

In [2]:
#Checking out the current working directory
print(os.getcwd())

C:\Users\Acer\Downloads\Business Analytics

In [3]:
#Load a spreadsheet and assigning it to a variable df.
# Open and work on "ExperimentOne.xlsx".
df = pd.read_excel("ExperimentOne.xlsx")

In [4]:
#View the dataframe
df

    ID   Post  Group
0    1  17.23  Cntrl
1    2  16.04  Cntrl
2    3  19.22  Cntrl
3    4  19.45  Cntrl
4    5  18.53  Cntrl
..  ..    ...    ...
69  70   6.86     Tx
70  71  17.63     Tx
71  72  18.84     Tx
72  73  15.11     Tx
73  74  19.07     Tx

[74 rows x 3 columns]

In [5]:
# Viewing the first 7 rows
df.head(7)

   ID   Post  Group
0   1  17.23  Cntrl
1   2  16.04  Cntrl
2   3  19.22  Cntrl
3   4  19.45  Cntrl
4   5  18.53  Cntrl
5   6  21.00  Cntrl
6   7  19.28  Cntrl

In [6]:
# Viewing the last 7 rows
df.tail(7)

    ID   Post Group
67  68  12.55    Tx
68  69  19.67    Tx
69  70   6.86    Tx
70  71  17.63    Tx
71  72  18.84    Tx
72  73  15.11    Tx
73  74  19.07    Tx

In [7]:
# Slice the data frame to only show the data on the "Post" Column.
s1 = df.iloc[:,1]
s1

0     17.23
1     16.04
2     19.22
3     19.45
4     18.53
      ...
69     6.86
70    17.63
71    18.84
72    15.11
73    19.07
Name: Post, Length: 74, dtype: float64

In [8]:
# Create different subsets of the data frame and show it.
# Get the data for the first column
sub1 = df.iloc[:, 2]
print(sub1)

sub2 = df.iloc[:, 0] 
sub2

0     Cntrl
1     Cntrl
2     Cntrl
3     Cntrl
4     Cntrl
      ...
69       Tx
70       Tx
71       Tx
72       Tx
73       Tx
Name: Group, Length: 74, dtype: object

0      1
1      2
2      3
3      4
4      5
      ..
69    70
70    71
71    72
72    73
73    74
Name: ID, Length: 74, dtype: int64

In [9]:
# Get the Post Test and Group data for records 1-10 
sub3 = df.iloc[1:11, 1:3]
sub3

     Post  Group
1   16.04  Cntrl
2   19.22  Cntrl
3   19.45  Cntrl
4   18.53  Cntrl
5   21.00  Cntrl
6   19.28  Cntrl
7   19.63  Cntrl
8   12.66  Cntrl
9   17.55  Cntrl
10  18.08  Cntrl

In [10]:
# Get the Post Test and Group data for records 7,11,15,50,61.
sub4 = df.iloc[[7,11,15,50,61], 1:3]
sub4

     Post  Group
7   19.63  Cntrl
11  16.55  Cntrl
15  21.04  Cntrl
50  18.58     Tx
61  16.41     Tx

In [11]:
# Check the information of the data frame such as number of records and features,
# data types of each feature and file size.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      74 non-null     int64
 1   Post    74 non-null     float64
 2   Group   74 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 1.9+ KB

In [12]:
#Checking for NAs or missing cases for the data set
df.isnull().values.any()

np.False_

In [13]:
# Check for NAs per column
missing_df2= df[df.isnull().any(axis=1)]

In [14]:
# Provide a descriptive analysis for the Post Test measure
desc = df.describe()
desc.T

      count       mean        std   min     25%     50%    75%    max
ID     74.0  37.500000  21.505813  1.00  19.250  37.500  55.75  74.00
Post   74.0  16.924324   3.344020  5.28  16.055  18.205  19.16  21.04

In [15]:
# Provide a descriptive analysis for Post Test measure per Group.
# Make sure that it is rounded to two decimal places only.
# Save this in the variable labeled results.
# Present the results variable